### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_access_policy.backoffice_func_key_vault_access_policy_itn will be created
  + resource "azurerm_key_vault_access_policy" "backoffice_func_key_vault_access_policy_itn" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-sign-kv"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_private_endpoint.io_sign_backoffice_func_itn will be created
  + resource "azurerm_private_endpoint" "io_sign_backoffice_func_itn" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-sign-backoffice-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-sign-data-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-sign-backoffice-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # azurerm_private_endpoint.io_sign_backoffice_func_staging_itn will be created
  + resource "azurerm_private_endpoint" "io_sign_backoffice_func_staging_itn" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-sign-backoffice-func-staging-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-sign-data-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-sign-backoffice-func-staging-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.io_sign_backoffice_func_itn.azurerm_app_service_virtual_network_swift_connection.this[0] will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "this" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-sign-backoffice-snet-01"
    }

  # module.io_sign_backoffice_func_itn.azurerm_linux_function_app.this will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                  = "5"
          + "AzureWebJobs.createApiKeyById.Disabled"           = "true"
          + "AzureWebJobs.getApiKey.Disabled"                  = "true"
          + "AzureWebJobs.onSelfcareContractsMessage.Disabled" = "true"
          + "BACK_OFFICE_API_BASE_PATH"                        = "https://api.io.pagopa.it/api/v1/sign/backoffice"
          + "BACK_OFFICE_API_KEY"                              = "[REDACTED]"
          + "COSMOS_DB_CONNECTION_STRING"                      = (sensitive value)
          + "COSMOS_DB_NAME"                                   = "backoffice"
          + "GOOGLE_CLIENT_EMAIL"                              = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=bo-google-client-email)"
          + "GOOGLE_PRIVATE_KEY"                               = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=bo-google-private-key)"
          + "GOOGLE_SPREADSHEET_ID"                            = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=bo-google-spreadsheet-id)"
          + "NODE_ENV"                                         = "production"
          + "SELFCARE_API_KEY"                                 = "[REDACTED]"
          + "SELFCARE_EVENT_HUB_CONTRACTS_NAME"                = "sc-contracts"
          + "SLACK_WEBHOOK_URL"                                = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=slack-webhook-url)"
          + "SLOT_TASK_HUBNAME"                                = "ProductionTaskHub"
          + "SelfCareEventHubConnectionString"                 = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=SelfCareEventHubConnectionString)"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"  = "1"
          + "WEBSITE_DNS_SERVER"                               = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                         = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-sign-backoffice-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "io-p-itn-sign-backend-rg-01"
      + service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-sign-backoffice-app-asp-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "iopitnsignbostfn01"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_key                = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = 1
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "SLOT_TASK_HUBNAME",
              + "AzureWebJobs.onSelfcareContractsMessage.Disabled",
              + "AzureWebJobs.getApiKey.Disabled",
              + "AzureWebJobs.createApiKeyById.Disabled",
            ]
        }
    }

  # module.io_sign_backoffice_func_itn.azurerm_monitor_metric_alert.function_app_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      + auto_mitigate            = false
      + description              = "Function availability is under threshold level. Runbook: -"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[io-p-itn-sign-backoffice-func-01] Health Check Failed"
      + resource_group_name      = "io-p-itn-sign-backend-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.io_sign_backoffice_func_staging_slot_itn.azurerm_app_service_slot_virtual_network_swift_connection.this[0] will be created
  + resource "azurerm_app_service_slot_virtual_network_swift_connection" "this" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + slot_name      = "staging"
      + subnet_id      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-sign-backoffice-snet-01"
    }

  # module.io_sign_backoffice_func_staging_slot_itn.azurerm_linux_function_app_slot.this will be created
  + resource "azurerm_linux_function_app_slot" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                  = "5"
          + "AzureWebJobs.createApiKeyById.Disabled"           = "true"
          + "AzureWebJobs.getApiKey.Disabled"                  = "true"
          + "AzureWebJobs.onSelfcareContractsMessage.Disabled" = "true"
          + "BACK_OFFICE_API_BASE_PATH"                        = "https://api.io.pagopa.it/api/v1/sign/backoffice"
          + "BACK_OFFICE_API_KEY"                              = "[REDACTED]"
          + "COSMOS_DB_CONNECTION_STRING"                      = (sensitive value)
          + "COSMOS_DB_NAME"                                   = "backoffice"
          + "GOOGLE_CLIENT_EMAIL"                              = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=bo-google-client-email)"
          + "GOOGLE_PRIVATE_KEY"                               = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=bo-google-private-key)"
          + "GOOGLE_SPREADSHEET_ID"                            = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=bo-google-spreadsheet-id)"
          + "NODE_ENV"                                         = "production"
          + "SELFCARE_API_KEY"                                 = "[REDACTED]"
          + "SELFCARE_EVENT_HUB_CONTRACTS_NAME"                = "sc-contracts"
          + "SLACK_WEBHOOK_URL"                                = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=slack-webhook-url)"
          + "SLOT_TASK_HUBNAME"                                = "StagingTaskHub"
          + "SelfCareEventHubConnectionString"                 = "@Microsoft.KeyVault(VaultName=io-p-sign-kv;SecretName=SelfCareEventHubConnectionString)"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"  = "1"
          + "WEBSITE_DNS_SERVER"                               = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                         = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + function_app_id                                = (known after apply)
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (sensitive value)
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + webdeploy_publish_basic_authentication_enabled = true

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_key                = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = 1
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.io_sign_backoffice_func_itn.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitnsignbostfn01] Low Availability"
      + resource_group_name      = "io-p-itn-sign-backend-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignbostfn01",
        ]
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 27 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
